[{
    "name": "Aadya Deshpande2",
    "college": "M.B.B.S | GRANT MEDICAL COLLEGE AND SIR J. J. GROUP OF HOSPITALS, MUMBAI",
    "ranks": "NEET | 692 / 720 \n NEET All India Rank | 355 \n XII Boards | 99.33 %",
    "profile": "/images/testimonial/70/aadya-deshpande.jpg",
    "paragraph1": "A huge thank you to Paathshala and Photon Ecademy. My NEET performance would not have been possible without them! Their Early Completion of Syllabus Strategy enabled me to revise the entire syllabus more than 5 to 6 times, which was not possible for other students that I know from other institutes, as their syllabus was completed just 3 to 4 months before the NEET exam, in which case revision would not at all be possible for any student",
    "paragraph2": "Also, their one to one, extensively personalized teaching played an important role not only in effective teaching but also in completing the syllabus early, since it is not possible to complete the syllabus fast in a batch or a group teaching mode. I could get my doubts solved swiftly because of the personalized mode. However, that would not have been possible for me, if I was studying elsewhere in a batch or a group. I have given around 200 to 250 Full Syllabus Tests",
    "paragraph3": "What I realized is, in the beginning, the Full Syllabus Tests seem challenging and the scores are usually low, lower than the Part Syllabus Tests. As we keep at them and keep going, analyze our mistakes thoroughly and work on our weak topics and chapters, our scores in FSTs start improving. It is also important to not compare your performance with anyone else’s but with your own previous performance. It is important to balance or eliminate hyper normal stimuli like video gaming, excessive eating, watching videos online, which, if not moderated might be a huge obstacle to the path of preparation",
    "paragraph4": "All along, love the process of learning science and gathering knowledge and try to learn from the mistakes rather than feel bad about the mistakes made in the tests or any low scores. As many problems as possible should be solved and it is also a great idea to solve the same problem set multiple times to become more confident in a chapter or topic",
    "admission": "Secured Admission At Grant Medical College and Sir J. J. Group of Hospitals, Mumbai for M.B.B.S",
    "video": "https://youtu.be/8GmVNb_6Ckk"

}]